number = input()

a = number[0]
b = number[1]
c = number[2]

print(a + b + c)
print(a + c + b)
print(b + a + c)
print(b + c + a)
print(c + a + b)
print(c + b + a)
# Напишите программу, которая выводит шесть чисел, образованных при перестановке цифр заданного числа
